{
  "backend/main.mo": "Main actor defining fuel station management system with types for sales, branches, employees, loyalty programs, and prebookings; includes authorization, storage mixins, and CRUD operations for all entities with role-based access control.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (sales recording, inventory monitoring, alerts, billing, receipts, employee management, etc.) to their source files, components, and test IDs with confidence levels.",
  "frontend-file-summaries.txt": "JSON object containing one-sentence summaries of frontend component and page files, describing their UI responsibilities and data display patterns.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color system defining light and dark theme variables for background, foreground, primary, secondary, and chart colors with warm earth tones.",
  "frontend/index.html": "HTML entry point with root div and module script reference to main.tsx for the Petrol Pump Management System application.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with 13 routes (dashboard, sales, inventory, employees, reports, etc.), wrapping app with theme, branch, and emergency alert providers.",
  "frontend/src/components/BranchList.tsx": "Component displaying all branches in a responsive card grid showing location, fuel stock levels, and current prices for petrol and diesel.",
  "frontend/src/components/BranchLocationCard.tsx": "Card component rendering individual branch details including name, address, branch ID, and fuel availability indicator with map pin icon.",
  "frontend/src/components/BranchSelector.tsx": "Dropdown select component using branch context to allow users to switch between different fuel station branches.",
  "frontend/src/components/CreateBranchForm.tsx": "Form component with inputs for branch ID, name, and location that calls createBranch mutation to add new fuel station branches.",
  "frontend/src/components/CreateEmployeeForm.tsx": "Form component for creating new employees with fields for ID, name, role, and branch selection. Uses React Query mutations to submit employee data and resets form on success.",
  "frontend/src/components/CreatePrebookingForm.tsx": "Form component for creating fuel prebookings with customer details, fuel type, quantity, and delivery date. Converts delivery date to nanosecond timestamp for backend submission.",
  "frontend/src/components/EmergencyAlert.tsx": "Fixed-position alert banner that displays emergency notifications with severity-based styling (critical/warning/info). Allows users to dismiss individual alerts.",
  "frontend/src/components/EmployeeList.tsx": "Displays a searchable table of all employees with filtering by name, ID, or role. Shows employee details including ID, name, role, and branch assignment.",
  "frontend/src/components/EmployeePerformanceCard.tsx": "Card component displaying individual employee performance metrics including total sales, volume sold, revenue, and rank with trophy icon. Shows average revenue per sale.",
  "frontend/src/components/FuelGauge.tsx": "Visual fuel level indicator showing current level as percentage with progress bar and low stock warning. Displays different colors for petrol vs diesel.",
  "frontend/src/components/GSTCalculator.tsx": "Calculates and displays GST breakdown for petrol and diesel sales separately and in total. Shows taxable amount, GST collected at 18%, and total sales including GST.",
  "frontend/src/components/Layout.tsx": "Main application layout with header, navigation menu, authentication controls, and branch selector. Provides responsive navigation with mobile menu and route-based active states.",
  "frontend/src/components/LoyaltyMemberCard.tsx": "Card displaying loyalty member information including ID, phone, and total points. Includes button to open modal for adding points to the member's account.",
  "frontend/src/components/LoyaltyMemberList.tsx": "Displays a searchable list of loyalty members in a card grid layout, with filtering by name, phone, or ID.",
  "frontend/src/components/PaymentSummary.tsx": "Shows a breakdown of fuel purchase costs including base amount, 18% GST, and total amount in a card format.",
  "frontend/src/components/PointsTransactionModal.tsx": "Modal dialog for manually adding loyalty points to a member with optional reason field.",
  "frontend/src/components/PrebookingList.tsx": "Displays branch prebookings in a table with customer details and allows status updates via dropdown.",
  "frontend/src/components/PriceDisplayCard.tsx": "Card component showing fuel type (petrol/diesel) with price per liter and fuel icon.",
  "frontend/src/components/PriceUpdateForm.tsx": "Form for updating fuel prices at a selected branch with confirmation dialog showing current and new prices.",
  "frontend/src/components/ProfileSetup.tsx": "Modal dialog for first-time user profile setup requiring name entry before proceeding.",
  "frontend/src/components/ProfitLossStatement.tsx": "Displays detailed P&L metrics including revenue, COGS, gross profit, operating expenses, and net profit calculated from sales data.",
  "frontend/src/components/Receipt.tsx": "Printable receipt component showing sale details including fuel type, quantity, GST breakdown, and total amount.",
  "frontend/src/components/ReceiptModal.tsx": "Modal wrapper for the Receipt component with print and close buttons.",
  "frontend/src/components/RegisterMemberForm.tsx": "Form component for registering new loyalty program members with name and phone number fields, using mutation hook to submit data and display success toast.",
  "frontend/src/components/SalesForm.tsx": "Form component for recording fuel sales with fuel type, quantity, and payment method selection, displaying payment summary and submitting via mutation hook.",
  "frontend/src/components/SalesHistory.tsx": "Displays a sortable table of branch sales history with date, fuel type, quantity, payment method, and amount, with action button to view receipt details in modal.",
  "frontend/src/components/SalesReportSummary.tsx": "Dashboard component displaying sales metrics cards including total revenue, petrol/diesel volumes, transaction count, and payment method breakdown calculated from sales data.",
  "frontend/src/components/StockAlerts.tsx": "Displays destructive alerts for petrol and diesel when stock levels fall below branch-defined low stock thresholds.",
  "frontend/src/contexts/BranchContext.tsx": "React context provider for managing selected branch ID state with localStorage persistence and custom hook for accessing branch context.",
  "frontend/src/contexts/EmergencyAlertContext.tsx": "React context provider for managing emergency alerts with severity levels (critical/warning/info), supporting add/dismiss operations and maintaining alert history.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages backend actor instances based on Internet Identity authentication state, initializing access control with admin token and invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout flow, identity state, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including branches, sales, employees, loyalty members, prebookings, and user profiles. Includes mutations with toast notifications and query invalidation for cache management.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components, charts, and sidebar elements using HSL color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and wraps the app with InternetIdentityProvider and QueryClientProvider.",
  "frontend/src/pages/BranchesPage.tsx": "Branch management page that displays CreateBranchForm for admins and BranchList for all authenticated users.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard showing hero section for unauthenticated users, profile setup for new users, and real-time metrics (revenue, volume, stock) for authenticated users with branch selection.",
  "frontend/src/pages/EmployeesPage.tsx": "Employee management page displaying CreateEmployeeForm for admins and EmployeeList for all authenticated users.",
  "frontend/src/pages/InventoryPage.tsx": "Inventory monitoring page showing fuel gauges for petrol and diesel tanks with stock alerts for the selected branch.",
  "frontend/src/pages/LocationsPage.tsx": "Public-facing page displaying all branch locations in a grid of BranchLocationCard components.",
  "frontend/src/pages/LoyaltyPage.tsx": "Loyalty program management page with RegisterMemberForm and LoyaltyMemberList for authenticated users.",
  "frontend/src/pages/PerformanceReportsPage.tsx": "Employee performance analytics page that aggregates sales data by employee and displays ranked performance cards with metrics.",
  "frontend/src/pages/PrebookingPage.tsx": "Fuel prebooking page with CreatePrebookingForm and PrebookingList, requiring both authentication and branch selection.",
  "frontend/src/pages/PriceManagementPage.tsx": "Admin-only page for updating fuel prices across branches using PriceUpdateForm component.",
  "frontend/src/pages/ProfitLossPage.tsx": "Displays profit and loss analysis for admin users with authentication and branch selection checks, rendering the ProfitLossStatement component with sales data.",
  "frontend/src/pages/PublicPricesPage.tsx": "Public-facing page showing current petrol and diesel prices for all branches without authentication requirements, displaying prices in a grid layout.",
  "frontend/src/pages/ReportsPage.tsx": "Sales reports page with period filtering (daily/weekly/monthly), CSV export functionality, and summary display for authenticated users with branch selection.",
  "frontend/src/pages/SalesPage.tsx": "Sales management page with a form to record new fuel sales and a history view, requiring authentication and branch selection.",
  "frontend/src/pages/TaxReportsPage.tsx": "Admin-only page displaying GST and tax calculations using the GSTCalculator component, requiring authentication, admin privileges, and branch selection.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended theme settings for sidebar/charts/cards, custom animations, and typography/container-queries plugins.",
  "project_state.json": "Project metadata defining a petrol pump management system with multi-branch support, IoT integration, payment gateways, inventory tracking, employee management, and customer loyalty features."
}